results/routeA/failed_runs/A-SMOKE-attempt1-boundary-init/initialization_check/0/p_rgh
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    location    "0";
    object      p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [1 -1 -2 0 0 0 0];

internalField   nonuniform List<scalar> 
1600
(
-2.168404344971009e-19
-2.168404344971009e-19
2.168404344971009e-19
-4.336808689942018e-19
-2.168404344971009e-19
-4.336808689942018e-19
-2.168404344971009e-19
4.336808689942018e-19
...
)
;

boundaryField
{
    hotWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
40
(
-8.80281690141026e-07
-2.64084507042156e-06
-4.401408450703179e-06
-6.161971830983062e-06
-7.92253521126815e-06
-9.683098591548034e-06
-1.144366197183139e-05
-1.320422535211474e-05
...
)
;
    }
    coldWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
40
(
8.80281690141026e-07
2.640845070423295e-06
4.401408450703179e-06
6.161971830986532e-06
7.922535211264681e-06
9.683098591541095e-06
1.144366197182445e-05
1.32042253521078e-05
...
)
;
    }
    bottomWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           uniform 0;
    }
    topWall
    {
        type            fixedFluxPressure;
        gradient        uniform 0;
        value           nonuniform List<scalar> 
40
(
0
0
0
0
0
0
-2.775557561562891e-17
0
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
