results/routeA/failed_runs/A-SMOKE-attempt1-boundary-init/initialization_check/constant/hRef
FoamFile
{
    format ascii;
    class uniformDimensionedScalarField;
    location "constant";
    object hRef;
}
dimensions [0 1 0 0 0 0 0];
value 0;
